reddit_clone/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."parent_comment_id" IN ($1, $2, $3)  [["parent_comment_id", 1], ["parent_comment_id", 2], ["parent_comment_id", 3]]
---
<% if @post.comments %>
  <% @post.comments.where(parent_comment_id: nil).each do |comment| %>