reddit_clone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "test"], ["user_id", 1], ["post_id", 8], ["created_at", "2019-02-05 23:03:54.745617"], ["updated_at", "2019-02-05 23:03:54.745617"], ["parent_comment_id", 2]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.parent_comment_id = params[:comment][:parent_comment_id]
    @comment.post_id = params[:comment][:post_id] || @comment.parent_comment.post_id


    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @comment = Comment.find_by(id: params[:id])