reddit_clone/app/controllers/posts_controller.rb

  def show
    @post = Post.includes(comments: [:user]).find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "testpost"], ["url", "t"], ["content", "t"], ["user_id", 1], ["created_at", "2019-02-05 22:45:24.156512"], ["updated_at", "2019-02-05 22:45:24.156512"]]

  def update
    @post = current_user.posts.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]