reddit_clone/app/controllers/posts_controller.rb

  def show
    @post = Post.find_by(id: params[:id])
    @all_comments = Comment.all.includes(:user).includes(:child_comments)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 8]]