reddit_clone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id

    if @sub.save
---
INSERT INTO "subs" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sub1"], ["description", "Hello"], ["created_at", "2019-02-05 21:40:17.792838"], ["updated_at", "2019-02-05 21:40:17.792838"], ["user_id", 1]]